package lab6;

public class МузичнийАльбом {
    private МузичнаКомпозиція[] музичнаКомпозиціяs = new МузичнаКомпозиція[12];
    private int підраховувач;

    public void додати(МузичнаКомпозиція музичнаКомпозиція){
        музичнаКомпозиціяs[підраховувач++] = музичнаКомпозиція;
    }

    @Override
    public String toString() {
        String результат = "";
        for (int i = 0; i < підраховувач; i++) {
            результат += музичнаКомпозиціяs[i].toString();
        }
        return результат;
    }
}
